<?php
if ($npcc==1501) {
$xsbl=41;
//名字
$nname="【金咤】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=11;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1502) {
$xsbl=42;
//名字
$nname="【木咤】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=12;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1503) {
$xsbl=43;
//名字
$nname="【玉兔】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=13;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1504) {
$xsbl=44;
//名字
$nname="【玉兔】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=14;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1505) {
$xsbl=45;
//名字
$nname="【嫦娥】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=15;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1506) {
$xsbl=46;
//名字
$nname="【电母】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=16;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1507) {
$xsbl=47;
//名字
$nname="【电母】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=17;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1508) {
$xsbl=48;
//名字
$nname="【雷公】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=18;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1509) {
$xsbl=49;
//名字
$nname="【猪八戒】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=19;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1510) {
$xsbl=50;
//名字
$nname="【猪八戒】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=20;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1511) {
$xsbl=51;
//名字
$nname="【唐僧】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=21;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1512) {
$xsbl=52;
//名字
$nname="【沙僧】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=22;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1513) {
$xsbl=53;
//名字
$nname="【沙僧】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=23;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1514) {
$xsbl=54;
//名字
$nname="【孙悟空】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=24;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1515) {
$xsbl=55;
//名字
$nname="【云神】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=25;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1516) {
$xsbl=56;
//名字
$nname="【云神】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=26;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1517) {
$xsbl=57;
//名字
$nname="【夜游神】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=27;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1518) {
$xsbl=57;
//名字
$nname="【游奕灵官】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=28;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1519) {
$xsbl=58;
//名字
$nname="【游奕灵官】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=29;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1520) {
$xsbl=60;
//名字
$nname="【赤脚大仙】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=30;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1521) {
$xsbl=70;
//名字
$nname="【太阴星君】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1522) {
$xsbl=70;
//名字
$nname="【太阴星君】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1523) {
$xsbl=75;
//名字
$nname="【太白金星】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1524) {
$xsbl=80;
//名字
$nname="【巨灵神】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1525) {
$xsbl=80;
//名字
$nname="【巨灵神】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1526) {
$xsbl=85;
//名字
$nname="【夜游神】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1527) {
$xsbl=90;
//名字
$nname="【西王母】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1528) {
$xsbl=90;
//名字
$nname="【西王母】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1529) {
$xsbl=95;
//名字
$nname="【王母娘娘】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1530) {
$xsbl=100;
//名字
$nname="【十八罗汉】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1531) {
$xsbl=100;
//名字
$nname="【十八罗汉】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1532) {
$xsbl=105;
//名字
$nname="【镇元大仙】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1533) {
$xsbl=110;
//名字
$nname="【二郎神】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1534) {
$xsbl=110;
//名字
$nname="【二郎神】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1535) {
$xsbl=115;
//名字
$nname="【北斗仙君】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1536) {
$xsbl=120;
//名字
$nname="【哪吒】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1537) {
$xsbl=120;
//名字
$nname="【哪吒】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1538) {
$xsbl=125;
//名字
$nname="【李靖】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1539) {
$xsbl=130;
//名字
$nname="【卷帘大将】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1540) {
$xsbl=130;
//名字
$nname="【卷帘大将】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1541) {
$xsbl=135;
//名字
$nname="【天蓬元帅】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1542) {
$xsbl=140;
//名字
$nname="【五炁真君】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1543) {
$xsbl=140;
//名字
$nname="【五炁真君】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1544) {
$xsbl=145;
//名字
$nname="【太上老君】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1545) {
$xsbl=150;
//名字
$nname="【南极星君】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1546) {
$xsbl=150;
//名字
$nname="【南极星君】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1547) {
$xsbl=155;
//名字
$nname="【金顶大仙】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1548) {
$xsbl=160;
//名字
$nname="【金蝉子】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1549) {
$xsbl=160;
//名字
$nname="【金蝉子】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1550) {
	$xsbl=165;
//名字
$nname="【如来佛祖】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} else{
$nccp=2;
echo "<font color=black>没有这个id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}
?>