<?php
if ($npcc==1401) {
//名字
$nname="【千里眼】";
//等级
$ndj=100;
//HP
$nhp=500000;
//MAXHP
$nmaxhp=500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=112783;
//魔攻
$nmg=112783;
//防御
$nfy=112783;
//魔防
$nmf=112783;
//冰攻
$nbg=100;
//火攻
$nhg=100;
//雷攻
$nlg=100;
//冰防
$nbf=100;
//火防
$nhf=100;
//雷防
$nlf=100;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb3jbs-2.php");
//死亡掉落
} elseif ($npcc==1402) {
//名字
$nname="【千里眼】";
//等级
$ndj=100;
//HP
$nhp=500000;
//MAXHP
$nmaxhp=500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=112783;
//魔攻
$nmg=112783;
//防御
$nfy=112783;
//魔防
$nmf=112783;
//冰攻
$nbg=100;
//火攻
$nhg=100;
//雷攻
$nlg=100;
//冰防
$nbf=100;
//火防
$nhf=100;
//雷防
$nlf=100;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb3jbs-2.php");
//死亡掉落
} elseif ($npcc==1403) {
//名字
$nname="【顺风耳】";
//等级
$ndj=100;
//HP
$nhp=650000;
//MAXHP
$nmaxhp=650000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=152783;
//魔攻
$nmg=152783;
//防御
$nfy=152783;
//魔防
$nmf=152783;
//冰攻
$nbg=$ndj+10;
//火攻
$nhg=$ndj+10;
//雷攻
$nlg=$ndj+10;
//冰防
$nbf=$ndj+10;
//火防
$nhf=$ndj+10;
//雷防
$nlf=$ndj+10;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
include("./wj/fb3jbs-4.php");
//死亡掉落
} elseif ($npcc==1404) {
//名字
$nname="【炼丹童子】";
//等级
$ndj=110;
//HP
$nhp=700000;
//MAXHP
$nmaxhp=700000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=178644;
//魔攻
$nmg=178644;
//防御
$nfy=178644;
//魔防
$nmf=178644;
//冰攻
$nbg=$ndj+20;
//火攻
$nhg=$ndj+20;
//雷攻
$nlg=$ndj+20;
//冰防
$nbf=$ndj+20;
//火防
$nhf=$ndj+20;
//雷防
$nlf=$ndj+20;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb3jbs-2.php");
//死亡掉落
} elseif ($npcc==1405) {
//名字
$nname="【炼丹童子】";
//等级
$ndj=110;
//HP
$nhp=700000;
//MAXHP
$nmaxhp=700000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=178644;
//魔攻
$nmg=178644;
//防御
$nfy=178644;
//魔防
$nmf=178644;
//冰攻
$nbg=$ndj+20;
//火攻
$nhg=$ndj+20;
//雷攻
$nlg=$ndj+20;
//冰防
$nbf=$ndj+20;
//火防
$nhf=$ndj+20;
//雷防
$nlf=$ndj+20;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb3jbs-2.php");
//死亡掉落
} elseif ($npcc==1406) {
//名字
$nname="【善财童子】";
//等级
$ndj=110;
//HP
$nhp=1000000;
//MAXHP
$nmaxhp=1000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=213453;
//魔攻
$nmg=213453;
//防御
$nfy=213453;
//魔防
$nmf=213453;
//冰攻
$nbg=$ndj+30;
//火攻
$nhg=$ndj+30;
//雷攻
$nlg=$ndj+30;
//冰防
$nbf=$ndj+30;
//火防
$nhf=$ndj+30;
//雷防
$nlf=$ndj+30;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
include("./wj/fb3jbs-4.php");
//死亡掉落
} elseif ($npcc==1407) {
//名字
$nname="【推云童子】";
//等级
$ndj=120;
//HP
$nhp=1200000;
//MAXHP
$nmaxhp=1200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=234234;
//魔攻
$nmg=234234;
//防御
$nfy=234234;
//魔防
$nmf=234234;
//冰攻
$nbg=$ndj+40;
//火攻
$nhg=$ndj+40;
//雷攻
$nlg=$ndj+40;
//冰防
$nbf=$ndj+40;
//火防
$nhf=$ndj+40;
//雷防
$nlf=$ndj+40;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb3jbs-2.php");
//死亡掉落
} elseif ($npcc==1408) {
//名字
$nname="【推云童子】";
//等级
$ndj=120;
//HP
$nhp=1200000;
//MAXHP
$nmaxhp=1200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=234234;
//魔攻
$nmg=234234;
//防御
$nfy=234234;
//魔防
$nmf=234234;
//冰攻
$nbg=$ndj+40;
//火攻
$nhg=$ndj+40;
//雷攻
$nlg=$ndj+40;
//冰防
$nbf=$ndj+40;
//火防
$nhf=$ndj+40;
//雷防
$nlf=$ndj+40;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb3jbs-2.php");
//死亡掉落
} elseif ($npcc==1409) {
//名字
$nname="【红孩儿】";
//等级
$ndj=120;
//HP
$nhp=1500000;
//MAXHP
$nmaxhp=1500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=312343;
//魔攻
$nmg=312343;
//防御
$nfy=312343;
//魔防
$nmf=312343;
//冰攻
$nbg=$ndj+50;
//火攻
$nhg=$ndj+50;
//雷攻
$nlg=$ndj+50;
//冰防
$nbf=$ndj+50;
//火防
$nhf=$ndj+50;
//雷防
$nlf=$ndj+50;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
include("./wj/fb3jbs-4.php");
//死亡掉落
} elseif ($npcc==1410) {
//名字
$nname="【金咤】";
//等级
$ndj=130;
//HP
$nhp=2000000;
//MAXHP
$nmaxhp=2000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=335463;
//魔攻
$nmg=335463;
//防御
$nfy=335463;
//魔防
$nmf=335463;
//冰攻
$nbg=$ndj+60;
//火攻
$nhg=$ndj+60;
//雷攻
$nlg=$ndj+60;
//冰防
$nbf=$ndj+60;
//火防
$nhf=$ndj+60;
//雷防
$nlf=$ndj+60;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb4jbs-2.php");
//死亡掉落
} elseif ($npcc==1411) {
//名字
$nname="【金咤】";
//等级
$ndj=130;
//HP
$nhp=2000000;
//MAXHP
$nmaxhp=2000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=335463;
//魔攻
$nmg=335463;
//防御
$nfy=335463;
//魔防
$nmf=335463;
//冰攻
$nbg=$ndj+60;
//火攻
$nhg=$ndj+60;
//雷攻
$nlg=$ndj+60;
//冰防
$nbf=$ndj+60;
//火防
$nhf=$ndj+60;
//雷防
$nlf=$ndj+60;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb4jbs-2.php");
//死亡掉落
} elseif ($npcc==1412) {
//名字
$nname="【木咤】";
//等级
$ndj=130;
//HP
$nhp=2300000;
//MAXHP
$nmaxhp=2300000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=415432;
//魔攻
$nmg=415432;
//防御
$nfy=415432;
//魔防
$nmf=415432;
//冰攻
$nbg=$ndj+70;
//火攻
$nhg=$ndj+70;
//雷攻
$nlg=$ndj+70;
//冰防
$nbf=$ndj+70;
//火防
$nhf=$ndj+70;
//雷防
$nlf=$ndj+70;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
include("./wj/fb4jbs-4.php");
//死亡掉落
} elseif ($npcc==1413) {
//名字
$nname="【玉兔】";
//等级
$ndj=140;
//HP
$nhp=2800000;
//MAXHP
$nmaxhp=2800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=465432;
//魔攻
$nmg=465432;
//防御
$nfy=465432;
//魔防
$nmf=465432;
//冰攻
$nbg=$ndj+80;
//火攻
$nhg=$ndj+80;
//雷攻
$nlg=$ndj+80;
//冰防
$nbf=$ndj+80;
//火防
$nhf=$ndj+80;
//雷防
$nlf=$ndj+80;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb4jbs-2.php");
} elseif ($npcc==1414) {
//名字
$nname="【玉兔】";
//等级
$ndj=140;
//HP
$nhp=2800000;
//MAXHP
$nmaxhp=2800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=465432;
//魔攻
$nmg=465432;
//防御
$nfy=465432;
//魔防
$nmf=465432;
//冰攻
$nbg=$ndj+80;
//火攻
$nhg=$ndj+80;
//雷攻
$nlg=$ndj+80;
//冰防
$nbf=$ndj+80;
//火防
$nhf=$ndj+80;
//雷防
$nlf=$ndj+80;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb4jbs-2.php");
} elseif ($npcc==1415) {
//名字
$nname="【嫦娥】";
//等级
$ndj=140;
//HP
$nhp=3000000;
//MAXHP
$nmaxhp=3000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=513332;
//魔攻
$nmg=513332;
//防御
$nfy=513332;
//魔防
$nmf=513332;
//冰攻
$nbg=$ndj+90;
//火攻
$nhg=$ndj+90;
//雷攻
$nlg=$ndj+90;
//冰防
$nbf=$ndj+90;
//火防
$nhf=$ndj+90;
//雷防
$nlf=$ndj+90;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$bbdlsl= rand(1, 2);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
include("./wj/fb4jbs-4.php");
} elseif ($npcc==1416) {
//名字
$nname="【电母】";
//等级
$ndj=150;
//HP
$nhp=3200000;
//MAXHP
$nmaxhp=3200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=533332;
//魔攻
$nmg=533332;
//防御
$nfy=533332;
//魔防
$nmf=533332;
//冰攻
$nbg=$ndj+100;
//火攻
$nhg=$ndj+100;
//雷攻
$nlg=$ndj+100;
//冰防
$nbf=$ndj+100;
//火防
$nhf=$ndj+100;
//雷防
$nlf=$ndj+100;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb4jbs-2.php");
} elseif ($npcc==1417) {
//名字
$nname="【电母】";
//等级
$ndj=150;
//HP
$nhp=3200000;
//MAXHP
$nmaxhp=3200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=533332;
//魔攻
$nmg=533332;
//防御
$nfy=533332;
//魔防
$nmf=533332;
//冰攻
$nbg=$ndj+100;
//火攻
$nhg=$ndj+100;
//雷攻
$nlg=$ndj+100;
//冰防
$nbf=$ndj+100;
//火防
$nhf=$ndj+100;
//雷防
$nlf=$ndj+100;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb4jbs-2.php");
} elseif ($npcc==1418) {
//名字
$nname="【雷公】";
//等级
$ndj=150;
//HP
$nhp=3500000;
//MAXHP
$nmaxhp=3500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=605433;
//魔攻
$nmg=605433;
//防御
$nfy=605433;
//魔防
$nmf=605433;
//冰攻
$nbg=$ndj+110;
//火攻
$nhg=$ndj+110;
//雷攻
$nlg=$ndj+110;
//冰防
$nbf=$ndj+110;
//火防
$nhf=$ndj+110;
//雷防
$nlf=$ndj+110;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=6;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
include("./wj/fb4jbs-4.php");
} elseif ($npcc==1419) {
//名字
$nname="【猪八戒】";
//等级
$ndj=150;
//HP
$nhp=4000000;
//MAXHP
$nmaxhp=4000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=645433;
//魔攻
$nmg=645433;
//防御
$nfy=645433;
//魔防
$nmf=645433;
//冰攻
$nbg=$ndj+120;
//火攻
$nhg=$ndj+120;
//雷攻
$nlg=$ndj+120;
//冰防
$nbf=$ndj+120;
//火防
$nhf=$ndj+120;
//雷防
$nlf=$ndj+120;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb5jbs-2.php");
} elseif ($npcc==1420) {
//名字
$nname="【猪八戒】";
//等级
$ndj=150;
//HP
$nhp=4000000;
//MAXHP
$nmaxhp=4000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=645433;
//魔攻
$nmg=645433;
//防御
$nfy=645433;
//魔防
$nmf=645433;
//冰攻
$nbg=$ndj+120;
//火攻
$nhg=$ndj+120;
//雷攻
$nlg=$ndj+120;
//冰防
$nbf=$ndj+120;
//火防
$nhf=$ndj+120;
//雷防
$nlf=$ndj+120;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb5jbs-2.php");
} elseif ($npcc==1421) {
//名字
$nname="【唐僧】";
//等级
$ndj=150;
//HP
$nhp=4200000;
//MAXHP
$nmaxhp=4200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=705433;
//魔攻
$nmg=705433;
//防御
$nfy=705433;
//魔防
$nmf=705433;
//冰攻
$nbg=$ndj+130;
//火攻
$nhg=$ndj+130;
//雷攻
$nlg=$ndj+130;
//冰防
$nbf=$ndj+130;
//火防
$nhf=$ndj+130;
//雷防
$nlf=$ndj+130;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=7;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
include("./wj/fb5jbs-4.php");
} elseif ($npcc==1422) {
//名字
$nname="【沙僧】";
//等级
$ndj=150;
//HP
$nhp=4200000;
//MAXHP
$nmaxhp=4200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=735433;
//魔攻
$nmg=735433;
//防御
$nfy=735433;
//魔防
$nmf=735433;
//冰攻
$nbg=$ndj+140;
//火攻
$nhg=$ndj+140;
//雷攻
$nlg=$ndj+140;
//冰防
$nbf=$ndj+140;
//火防
$nhf=$ndj+140;
//雷防
$nlf=$ndj+140;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb5jbs-2.php");
} elseif ($npcc==1423) {
//名字
$nname="【沙僧】";
//等级
$ndj=150;
//HP
$nhp=4200000;
//MAXHP
$nmaxhp=4200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=735433;
//魔攻
$nmg=735433;
//防御
$nfy=735433;
//魔防
$nmf=735433;
//冰攻
$nbg=$ndj+140;
//火攻
$nhg=$ndj+140;
//雷攻
$nlg=$ndj+140;
//冰防
$nbf=$ndj+140;
//火防
$nhf=$ndj+140;
//雷防
$nlf=$ndj+140;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb5jbs-2.php");
} elseif ($npcc==1424) {
//名字
$nname="【孙悟空】";
//等级
$ndj=150;
//HP
$nhp=4500000;
//MAXHP
$nmaxhp=4500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=838833;
//魔攻
$nmg=838833;
//防御
$nfy=838833;
//魔防
$nmf=838833;
//冰攻
$nbg=$ndj+150;
//火攻
$nhg=$ndj+150;
//雷攻
$nlg=$ndj+150;
//冰防
$nbf=$ndj+150;
//火防
$nhf=$ndj+150;
//雷防
$nlf=$ndj+150;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=9;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
include("./wj/fb5jbs-4.php");
} elseif ($npcc==1425) {
//名字
$nname="【云神】";
//等级
$ndj=150;
//HP
$nhp=4800000;
//MAXHP
$nmaxhp=4800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=938833;
//魔攻
$nmg=938833;
//防御
$nfy=938833;
//魔防
$nmf=938833;
//冰攻
$nbg=$ndj+160;
//火攻
$nhg=$ndj+160;
//雷攻
$nlg=$ndj+160;
//冰防
$nbf=$ndj+160;
//火防
$nhf=$ndj+160;
//雷防
$nlf=$ndj+160;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb5jbs-2.php");
} elseif ($npcc==1426) {
//名字
$nname="【云神】";
//等级
$ndj=150;
//HP
$nhp=4800000;
//MAXHP
$nmaxhp=4800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=938833;
//魔攻
$nmg=938833;
//防御
$nfy=938833;
//魔防
$nmf=938833;
//冰攻
$nbg=$ndj+160;
//火攻
$nhg=$ndj+160;
//雷攻
$nlg=$ndj+160;
//冰防
$nbf=$ndj+160;
//火防
$nhf=$ndj+160;
//雷防
$nlf=$ndj+160;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb5jbs-2.php");
} elseif ($npcc==1427) {
//名字
$nname="【夜游神】";
//等级
$ndj=150;
//HP
$nhp=5000000;
//MAXHP
$nmaxhp=5000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1038833;
//魔攻
$nmg=1038833;
//防御
$nfy=1038833;
//魔防
$nmf=1038833;
//冰攻
$nbg=$ndj+170;
//火攻
$nhg=$ndj+170;
//雷攻
$nlg=$ndj+170;
//冰防
$nbf=$ndj+170;
//火防
$nhf=$ndj+170;
//雷防
$nlf=$ndj+170;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
include("./wj/fb5jbs-4.php");
} elseif ($npcc==1428) {
//名字
$nname="【游奕灵官】";
//等级
$ndj=150;
//HP
$nhp=5200000;
//MAXHP
$nmaxhp=5200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1113233;
//魔攻
$nmg=1113233;
//防御
$nfy=1113233;
//魔防
$nmf=1113233;
//冰攻
$nbg=$ndj+180;
//火攻
$nhg=$ndj+180;
//雷攻
$nlg=$ndj+180;
//冰防
$nbf=$ndj+180;
//火防
$nhf=$ndj+180;
//雷防
$nlf=$ndj+180;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb5jbs-2.php");
} elseif ($npcc==1429) {
//名字
$nname="【游奕灵官】";
//等级
$ndj=150;
//HP
$nhp=5200000;
//MAXHP
$nmaxhp=5200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1113233;
//魔攻
$nmg=1113233;
//防御
$nfy=1113233;
//魔防
$nmf=1113233;
//冰攻
$nbg=$ndj+180;
//火攻
$nhg=$ndj+180;
//雷攻
$nlg=$ndj+180;
//冰防
$nbf=$ndj+180;
//火防
$nhf=$ndj+180;
//雷防
$nlf=$ndj+180;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
include("./wj/fb5jbs-2.php");
} elseif ($npcc==1430) {
//名字
$nname="【赤脚大仙】";
//等级
$ndj=150;
//HP
$nhp=5500000;
//MAXHP
$nmaxhp=5500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1213233;
//魔攻
$nmg=1213233;
//防御
$nfy=1213233;
//魔防
$nmf=1213233;
//冰攻
$nbg=$ndj+200;
//火攻
$nhg=$ndj+200;
//雷攻
$nlg=$ndj+200;
//冰防
$nbf=$ndj+200;
//火防
$nhf=$ndj+200;
//雷防
$nlf=$ndj+200;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$bbdlsl= rand(1, 5);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
include("./wj/fb5jbs-4.php");
} elseif ($npcc==1431) {
//名字
$nname="【太阴星君】";
//等级
$ndj=150;
//HP
$nhp=5600000;
//MAXHP
$nmaxhp=5600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1253233;
//魔攻
$nmg=1253233;
//防御
$nfy=1253233;
//魔防
$nmf=1253233;
//冰攻
$nbg=$ndj+200;
//火攻
$nhg=$ndj+200;
//雷攻
$nlg=$ndj+200;
//冰防
$nbf=$ndj+200;
//火防
$nhf=$ndj+200;
//雷防
$nlf=$ndj+200;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==1432) {
//名字
$nname="【太阴星君】";
//等级
$ndj=150;
//HP
$nhp=5600000;
//MAXHP
$nmaxhp=5600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1253233;
//魔攻
$nmg=1253233;
//防御
$nfy=1253233;
//魔防
$nmf=1253233;
//冰攻
$nbg=$ndj+200;
//火攻
$nhg=$ndj+200;
//雷攻
$nlg=$ndj+200;
//冰防
$nbf=$ndj+200;
//火防
$nhf=$ndj+200;
//雷防
$nlf=$ndj+200;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==1433) {
//名字
$nname="【太白金星】";
//等级
$ndj=160;
//HP
$nhp=5800000;
//MAXHP
$nmaxhp=5800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1283233;
//魔攻
$nmg=1283233;
//防御
$nfy=1283233;
//魔防
$nmf=1283233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
} elseif ($npcc==1434) {
//名字
$nname="【巨灵神】";
//等级
$ndj=160;
//HP
$nhp=5900000;
//MAXHP
$nmaxhp=5900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1293233;
//魔攻
$nmg=1293233;
//防御
$nfy=1293233;
//魔防
$nmf=1293233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==1435) {
//名字
$nname="【巨灵神】";
//等级
$ndj=160;
//HP
$nhp=5900000;
//MAXHP
$nmaxhp=5900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1293233;
//魔攻
$nmg=1293233;
//防御
$nfy=1293233;
//魔防
$nmf=1293233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==1436) {
//名字
$nname="【夜游神】";
//等级
$ndj=165;
//HP
$nhp=6000000;
//MAXHP
$nmaxhp=6000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1303233;
//魔攻
$nmg=1303233;
//防御
$nfy=1303233;
//魔防
$nmf=1303233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
} elseif ($npcc==1437) {
//名字
$nname="【西王母】";
//等级
$ndj=165;
//HP
$nhp=6200000;
//MAXHP
$nmaxhp=6200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1323233;
//魔攻
$nmg=1323233;
//防御
$nfy=1323233;
//魔防
$nmf=1323233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==1438) {
//名字
$nname="【西王母】";
//等级
$ndj=165;
//HP
$nhp=6200000;
//MAXHP
$nmaxhp=6200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1323233;
//魔攻
$nmg=1323233;
//防御
$nfy=1323233;
//魔防
$nmf=1323233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==1439) {
//名字
$nname="【王母娘娘】";
//等级
$ndj=170;
//HP
$nhp=6500000;
//MAXHP
$nmaxhp=6500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1353233;
//魔攻
$nmg=1353233;
//防御
$nfy=1353233;
//魔防
$nmf=1353233;
//冰攻
$nbg=$ndj+215;
//火攻
$nhg=$ndj+215;
//雷攻
$nlg=$ndj+215;
//冰防
$nbf=$ndj+215;
//火防
$nhf=$ndj+215;
//雷防
$nlf=$ndj+215;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
} elseif ($npcc==1440) {
//名字
$nname="【十八罗汉】";
//等级
$ndj=170;
//HP
$nhp=6600000;
//MAXHP
$nmaxhp=6600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1373233;
//魔攻
$nmg=1373233;
//防御
$nfy=1373233;
//魔防
$nmf=1373233;
//冰攻
$nbg=$ndj+215;
//火攻
$nhg=$ndj+215;
//雷攻
$nlg=$ndj+215;
//冰防
$nbf=$ndj+215;
//火防
$nhf=$ndj+215;
//雷防
$nlf=$ndj+215;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==1441) {
//名字
$nname="【十八罗汉】";
//等级
$ndj=170;
//HP
$nhp=6600000;
//MAXHP
$nmaxhp=6600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1373233;
//魔攻
$nmg=1373233;
//防御
$nfy=1373233;
//魔防
$nmf=1373233;
//冰攻
$nbg=$ndj+215;
//火攻
$nhg=$ndj+215;
//雷攻
$nlg=$ndj+215;
//冰防
$nbf=$ndj+215;
//火防
$nhf=$ndj+215;
//雷防
$nlf=$ndj+215;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==1442) {
//名字
$nname="【镇元大仙】";
//等级
$ndj=175;
//HP
$nhp=6800000;
//MAXHP
$nmaxhp=6800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1403233;
//魔攻
$nmg=1403233;
//防御
$nfy=1403233;
//魔防
$nmf=1403233;
//冰攻
$nbg=$ndj+220;
//火攻
$nhg=$ndj+220;
//雷攻
$nlg=$ndj+220;
//冰防
$nbf=$ndj+220;
//火防
$nhf=$ndj+220;
//雷防
$nlf=$ndj+220;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
} elseif ($npcc==1443) {
//名字
$nname="【二郎神】";
//等级
$ndj=175;
//HP
$nhp=7000000;
//MAXHP
$nmaxhp=7000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1433233;
//魔攻
$nmg=1433233;
//防御
$nfy=1433233;
//魔防
$nmf=1433233;
//冰攻
$nbg=$ndj+220;
//火攻
$nhg=$ndj+220;
//雷攻
$nlg=$ndj+220;
//冰防
$nbf=$ndj+220;
//火防
$nhf=$ndj+220;
//雷防
$nlf=$ndj+220;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==1444) {
//名字
$nname="【二郎神】";
//等级
$ndj=175;
//HP
$nhp=7000000;
//MAXHP
$nmaxhp=7000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1433233;
//魔攻
$nmg=1433233;
//防御
$nfy=1433233;
//魔防
$nmf=1433233;
//冰攻
$nbg=$ndj+220;
//火攻
$nhg=$ndj+220;
//雷攻
$nlg=$ndj+220;
//冰防
$nbf=$ndj+220;
//火防
$nhf=$ndj+220;
//雷防
$nlf=$ndj+220;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==1445) {
//名字
$nname="【太白金星】";
//等级
$ndj=180;
//HP
$nhp=7300000;
//MAXHP
$nmaxhp=7300000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1453233;
//魔攻
$nmg=1453233;
//防御
$nfy=1453233;
//魔防
$nmf=1453233;
//冰攻
$nbg=$ndj+225;
//火攻
$nhg=$ndj+225;
//雷攻
$nlg=$ndj+225;
//冰防
$nbf=$ndj+225;
//火防
$nhf=$ndj+225;
//雷防
$nlf=$ndj+225;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$bbdlsl= rand(1, 10);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1446) {
//名字
$nname="【哪吒】";
//等级
$ndj=180;
//HP
$nhp=7500000;
//MAXHP
$nmaxhp=7500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1503233;
//魔攻
$nmg=1503233;
//防御
$nfy=1503233;
//魔防
$nmf=1503233;
//冰攻
$nbg=$ndj+225;
//火攻
$nhg=$ndj+225;
//雷攻
$nlg=$ndj+225;
//冰防
$nbf=$ndj+225;
//火防
$nhf=$ndj+225;
//雷防
$nlf=$ndj+225;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1447) {
//名字
$nname="【哪吒】";
//等级
$ndj=180;
//HP
$nhp=7500000;
//MAXHP
$nmaxhp=7500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1503233;
//魔攻
$nmg=1503233;
//防御
$nfy=1503233;
//魔防
$nmf=1503233;
//冰攻
$nbg=$ndj+225;
//火攻
$nhg=$ndj+225;
//雷攻
$nlg=$ndj+225;
//冰防
$nbf=$ndj+225;
//火防
$nhf=$ndj+225;
//雷防
$nlf=$ndj+225;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1448) {
//名字
$nname="【李靖】";
//等级
$ndj=185;
//HP
$nhp=7700000;
//MAXHP
$nmaxhp=7700000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1503233;
//魔攻
$nmg=1553233;
//防御
$nfy=1553233;
//魔防
$nmf=1503233;
//冰攻
$nbg=$ndj+230;
//火攻
$nhg=$ndj+230;
//雷攻
$nlg=$ndj+230;
//冰防
$nbf=$ndj+230;
//火防
$nhf=$ndj+230;
//雷防
$nlf=$ndj+230;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1449) {
//名字
$nname="【卷帘大将】";
//等级
$ndj=185;
//HP
$nhp=7900000;
//MAXHP
$nmaxhp=7900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1603233;
//魔攻
$nmg=1603233;
//防御
$nfy=1603233;
//魔防
$nmf=1603233;
//冰攻
$nbg=$ndj+230;
//火攻
$nhg=$ndj+230;
//雷攻
$nlg=$ndj+230;
//冰防
$nbf=$ndj+230;
//火防
$nhf=$ndj+230;
//雷防
$nlf=$ndj+230;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1450) {
//名字
$nname="【卷帘大将】";
//等级
$ndj=185;
//HP
$nhp=7900000;
//MAXHP
$nmaxhp=7900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1603233;
//魔攻
$nmg=1603233;
//防御
$nfy=1603233;
//魔防
$nmf=1603233;
//冰攻
$nbg=$ndj+230;
//火攻
$nhg=$ndj+230;
//雷攻
$nlg=$ndj+230;
//冰防
$nbf=$ndj+230;
//火防
$nhf=$ndj+230;
//雷防
$nlf=$ndj+230;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1451) {
//名字
$nname="【天蓬元帅】";
//等级
$ndj=190;
//HP
$nhp=8000000;
//MAXHP
$nmaxhp=8000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1703233;
//魔攻
$nmg=1703233;
//防御
$nfy=1703233;
//魔防
$nmf=1703233;
//冰攻
$nbg=$ndj+240;
//火攻
$nhg=$ndj+240;
//雷攻
$nlg=$ndj+240;
//冰防
$nbf=$ndj+240;
//火防
$nhf=$ndj+240;
//雷防
$nlf=$ndj+240;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1452) {
//名字
$nname="【五炁真君】";
//等级
$ndj=190;
//HP
$nhp=8000000;
//MAXHP
$nmaxhp=8000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1753233;
//魔攻
$nmg=1753233;
//防御
$nfy=1753233;
//魔防
$nmf=1753233;
//冰攻
$nbg=$ndj+240;
//火攻
$nhg=$ndj+240;
//雷攻
$nlg=$ndj+240;
//冰防
$nbf=$ndj+240;
//火防
$nhf=$ndj+240;
//雷防
$nlf=$ndj+240;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1453) {
//名字
$nname="【五炁真君】";
//等级
$ndj=190;
//HP
$nhp=8000000;
//MAXHP
$nmaxhp=8000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1753233;
//魔攻
$nmg=1753233;
//防御
$nfy=1753233;
//魔防
$nmf=1753233;
//冰攻
$nbg=$ndj+240;
//火攻
$nhg=$ndj+240;
//雷攻
$nlg=$ndj+240;
//冰防
$nbf=$ndj+240;
//火防
$nhf=$ndj+240;
//雷防
$nlf=$ndj+240;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1454) {
//名字
$nname="【太上老君】";
//等级
$ndj=195;
//HP
$nhp=8500000;
//MAXHP
$nmaxhp=8500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1803233;
//魔攻
$nmg=1803233;
//防御
$nfy=1803233;
//魔防
$nmf=1803233;
//冰攻
$nbg=$ndj+250;
//火攻
$nhg=$ndj+250;
//雷攻
$nlg=$ndj+250;
//冰防
$nbf=$ndj+250;
//火防
$nhf=$ndj+250;
//雷防
$nlf=$ndj+250;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1455) {
//名字
$nname="【南极星君】";
//等级
$ndj=195;
//HP
$nhp=8500000;
//MAXHP
$nmaxhp=8500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1853233;
//魔攻
$nmg=1853233;
//防御
$nfy=1853233;
//魔防
$nmf=1853233;
//冰攻
$nbg=$ndj+250;
//火攻
$nhg=$ndj+250;
//雷攻
$nlg=$ndj+250;
//冰防
$nbf=$ndj+250;
//火防
$nhf=$ndj+250;
//雷防
$nlf=$ndj+250;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1456) {
//名字
$nname="【南极星君】";
//等级
$ndj=195;
//HP
$nhp=8500000;
//MAXHP
$nmaxhp=8500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1853233;
//魔攻
$nmg=1853233;
//防御
$nfy=1853233;
//魔防
$nmf=1853233;
//冰攻
$nbg=$ndj+250;
//火攻
$nhg=$ndj+250;
//雷攻
$nlg=$ndj+250;
//冰防
$nbf=$ndj+250;
//火防
$nhf=$ndj+250;
//雷防
$nlf=$ndj+250;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1457) {
//名字
$nname="【金顶大仙】";
//等级
$ndj=200;
//HP
$nhp=9000000;
//MAXHP
$nmaxhp=9000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1903233;
//魔攻
$nmg=1903233;
//防御
$nfy=1903233;
//魔防
$nmf=1903233;
//冰攻
$nbg=$ndj+255;
//火攻
$nhg=$ndj+255;
//雷攻
$nlg=$ndj+255;
//冰防
$nbf=$ndj+255;
//火防
$nhf=$ndj+255;
//雷防
$nlf=$ndj+255;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1458) {
//名字
$nname="【金蝉子】";
//等级
$ndj=210;
//HP
$nhp=9200000;
//MAXHP
$nmaxhp=9200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2003233;
//魔攻
$nmg=2003233;
//防御
$nfy=2003233;
//魔防
$nmf=2003233;
//冰攻
$nbg=$ndj+255;
//火攻
$nhg=$ndj+255;
//雷攻
$nlg=$ndj+255;
//冰防
$nbf=$ndj+255;
//火防
$nhf=$ndj+255;
//雷防
$nlf=$ndj+255;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1459) {
//名字
$nname="【金蝉子】";
//等级
$ndj=210;
//HP
$nhp=9200000;
//MAXHP
$nmaxhp=9200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2003233;
//魔攻
$nmg=2003233;
//防御
$nfy=2003233;
//魔防
$nmf=2003233;
//冰攻
$nbg=$ndj+255;
//火攻
$nhg=$ndj+255;
//雷攻
$nlg=$ndj+255;
//冰防
$nbf=$ndj+255;
//火防
$nhf=$ndj+255;
//雷防
$nlf=$ndj+255;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1460) {
//名字
$nname="【如来佛祖】";
//等级
$ndj=220;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2203233;
//魔攻
$nmg=2203233;
//防御
$nfy=2203233;
//魔防
$nmf=2203233;
//冰攻
$nbg=$ndj+260;
//火攻
$nhg=$ndj+260;
//雷攻
$nlg=$ndj+260;
//冰防
$nbf=$ndj+260;
//火防
$nhf=$ndj+260;
//雷防
$nlf=$ndj+260;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖齐天大圣〗（宠物蛋）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=570;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$bbdlsl= rand(1, 20);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1461) {
$xsbl=1;
//名字
$nname="【神瑛侍卫】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1462) {
$xsbl=2;
//名字
$nname="【神瑛侍卫】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1463) {
$xsbl=3;
//名字
$nname="【三清道人】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1464) {
$xsbl=4;
//名字
$nname="【银炉童子】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1465) {
$xsbl=5;
//名字
$nname="【银炉童子】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1466) {
$xsbl=6;
//名字
$nname="【如意真仙】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1467) {
$xsbl=7;
//名字
$nname="【金炉童子】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1468) {
$xsbl=8;
//名字
$nname="【金炉童子】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1469) {
$xsbl=9;
//名字
$nname="【广目天王】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1470) {
$xsbl=10;
//名字
$nname="【武曲星君】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1471) {
$xsbl=11;
//名字
$nname="【武曲星君】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1472) {
$xsbl=12;
//名字
$nname="【文殊菩萨】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1473) {
$xsbl=13;
//名字
$nname="【文昌星君】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1474) {
$xsbl=14;
//名字
$nname="【文昌星君】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1475) {
$xsbl=15;
//名字
$nname="【姜子牙】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$bbdlsl= rand(1, 3);
$wpdz1[]="〖大号财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=487;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率
} elseif ($npcc==1476) {
$xsbl=16;
//名字
$nname="【多闻天王】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1477) {
$xsbl=17;
//名字
$nname="【多闻天王】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1478) {
$xsbl=18;
//名字
$nname="【观世音菩萨】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1479) {
$xsbl=19;
//名字
$nname="【纠察灵官】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1480) {
$xsbl=20;
//名字
$nname="【纠察灵官】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1481) {
$xsbl=21;
//名字
$nname="【菩提祖师】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1482) {
$xsbl=22;
//名字
$nname="【太乙真人】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1483) {
$xsbl=23;
//名字
$nname="【太乙真人】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1484) {
$xsbl=24;
//名字
$nname="【太乙天尊】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1485) {
$xsbl=25;
//名字
$nname="【美猴王】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1486) {
$xsbl=26;
//名字
$nname="【美猴王】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1487) {
$xsbl=27;
//名字
$nname="【玉皇大帝】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1488) {
$xsbl=28;
//名字
$nname="【太上老君】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1489) {
$xsbl=29;
//名字
$nname="【太上老君】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==1490) {
$xsbl=30;
//名字
$nname="【元始天尊】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$bbdlsl= rand(1, 5);
$wpdz1[]="〖大号财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=487;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率
$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率
} elseif ($npcc==1491) {
$xsbl=31;
//名字
$nname="【千里眼】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1492) {
$xsbl=32;
//名字
$nname="【千里眼】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1493) {
$xsbl=33;
//名字
$nname="【顺风耳】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1494) {
$xsbl=34;
//名字
$nname="【炼丹童子】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1495) {
$xsbl=35;
//名字
$nname="【炼丹童子】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1496) {
$xsbl=36;
//名字
$nname="【善财童子】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=6;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1497) {
$xsbl=37;
//名字
$nname="【推云童子】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=7;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1498) {
$xsbl=38;
//名字
$nname="【推云童子】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=8;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1499) {
$xsbl=39;
//名字
$nname="【红孩儿】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=9;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} elseif ($npcc==1500) {
$xsbl=40;
//名字
$nname="【金咤】（魔）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
include("./wj/hddl.php");
$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
//死亡掉落
} else{
$nccp=2;
echo "<font color=black>没有这个id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}
?>